Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: As a widely spread tool, it has many wrappers which make its usage really simple, instead of manual invoking of gettext described below, you might want to try one of them, for example `intltool`_.
sv: Som ett allmÃ¤nt utbrett verktyg har det mÃ¥nga wrappers som gÃ¶r det vÃ¤ldigt enkelt att anvÃ¤nda. IstÃ¤llet fÃ¶r att manuellt anropa gettext som beskrivs nedan kan du prova nÃ¥gon av dem, till exempel `intltool`_.

source: Workflow overview
sv: Ãversikt Ã¶ver arbetsflÃ¶det

source: The GNU gettext uses several files to manage the localization:
sv: GNU gettext anvÃ¤nder flera filer fÃ¶r att hantera lokaliseringen:

source: :file:`PACKAGE.pot` contains strings extracted from your source code, typically using `xgettext`_ or some high level wrappers such as `intltool`_.
sv: :file:`PACKAGE.pot` innehÃ¥ller strÃ¤ngar som extraherats frÃ¥n din kÃ¤llkod, vanligtvis med hjÃ¤lp av `xgettext`_ eller nÃ¥gon hÃ¶gnivÃ¥wrapper som `intltool`_.

source: :file:`LANGUAGE.po` contains strings with a translation to single language. It has to be updated by `msgmerge`_ once the :file:`PACKAGE.pot` is updated. You can create new language files using `msginit`_ or within Weblate.
sv: :file:`LANGUAGE.po` innehÃ¥ller strÃ¤ngar med en Ã¶versÃ¤ttning till ett enda sprÃ¥k. Den mÃ¥ste uppdateras med `msgmerge`_ nÃ¤r :file:`PACKAGE.pot` har uppdaterats. Du kan skapa nya sprÃ¥kfiler med `msginit`_ eller i Weblate.

source: :file:`LANGUAGE.mo` contains binary representation of :file:`LANGUAGE.po` and is used at application runtime. Typically it is not kept under version control, but generated at compilation time using `msgfmt`_. In case you want to have it in the version control, you can generate it in Weblate using :ref:`addon-weblate.gettext.mo` add-on.
sv: :file:`LANGUAGE.mo` innehÃ¥ller binÃ¤r representation av :file:`LANGUAGE.po` och anvÃ¤nds vid programmets kÃ¶rning. Vanligtvis sparas den inte i versionshanteringen, utan genereras vid kompilering med hjÃ¤lp av `msgfmt`_. Om du vill ha den i versionshanteringen kan du generera den i Weblate med hjÃ¤lp av tillÃ¤gget :ref:`addon-weblate.gettext.mo`.

source: Overall the GNU gettext workflow looks like this:
sv: Totalt sett ser arbetsflÃ¶det fÃ¶r GNU gettext ut sÃ¥ hÃ¤r:

source: `Overview of GNU gettext <https://www.gnu.org/software/gettext/manual/html_node/Overview.html>`_
sv: `Ãversikt Ã¶ver GNU gettext <https://www.gnu.org/software/gettext/manual/html_node/Overview.html>`_

source: Sample program
sv: Exempelprogram

source: The simple program in C using gettext might look like following:
sv: Det enkla programmet i C som anvÃ¤nder gettext kan se ut sÃ¥ hÃ¤r:

source: Extracting translatable strings
sv: Extrahera Ã¶versÃ¤ttningsbara strÃ¤ngar

source: Once you have code using the gettext calls, you can use `xgettext`_ to extract messages from it and store them into a `.pot <https://www.gnu.org/software/gettext/manual/gettext.html#index-files_002c-_002epot>`_:
sv: NÃ¤r du har kod som anvÃ¤nder gettext-anrop kan du anvÃ¤nda `xgettext`_ fÃ¶r att extrahera meddelanden frÃ¥n den och lagra dem i en `.pot <https://www.gnu.org/software/gettext/manual/gettext.html#index-files_002c-_002epot>`_:

source: There are alternative programs to extract strings from the code, for example `pybabel`_.
sv: Det finns alternativa program fÃ¶r att extrahera strÃ¤ngar frÃ¥n koden, till exempel `pybabel`_.

source: This creates a template file, which you can use for starting new translations (using `msginit`_) or updating existing ones after code change (you would use `msgmerge`_ for that). The resulting file is simply a structured text file:
sv: Detta skapar en mallfil som du kan anvÃ¤nda fÃ¶r att starta nya Ã¶versÃ¤ttningar (med `msginit`_) eller uppdatera befintliga efter kodÃ¤ndringar (fÃ¶r detta anvÃ¤nder du `msgmerge`_). Den resulterande filen Ã¤r helt enkelt en strukturerad textfil:

source: Each ``msgid`` line defines a string to translate, the special empty string in the beginning is the file header containing metadata about the translation.
sv: Varje ``msgid``-rad definierar en strÃ¤ng som ska Ã¶versÃ¤ttas. Den speciella tomma strÃ¤ngen i bÃ¶rjan Ã¤r filhuvudet som innehÃ¥ller metadata om Ã¶versÃ¤ttningen.

source: Starting new translation
sv: Starta ny Ã¶versÃ¤ttning

source: With the template in place, we can start our first translation:
sv: NÃ¤r mallen Ã¤r pÃ¥ plats kan vi bÃ¶rja vÃ¥r fÃ¶rsta Ã¶versÃ¤ttning:

source: The just created :file:`cs.po` already has some information filled in. Most importantly it got the proper plural forms definition for chosen language and you can see number of plurals have changed according to that:
sv: Den nyskapade filen :file:`cs.po` innehÃ¥ller redan viss information. Viktigast av allt Ã¤r att den har rÃ¤tt pluralformer fÃ¶r det valda sprÃ¥ket, och du kan se att antalet pluralformer har Ã¤ndrats i enlighet med detta:

source: This file is compiled into an optimized binary form, the `.mo <https://www.gnu.org/software/gettext/manual/gettext.html#MO-Files>`_ file used by the `GNU gettext`_ functions at runtime.
sv: Denna fil kompileras till en optimerad binÃ¤r form, filen `.mo <https://www.gnu.org/software/gettext/manual/gettext.html#MO-Files>`_ som anvÃ¤nds av `GNU gettext`_-funktionerna vid kÃ¶rning.

source: Updating strings
sv: Uppdatering av strÃ¤ngar

source: Once you add more strings or change some strings in your program, you execute again `xgettext`_ which regenerates the template file:
sv: NÃ¤r du har lagt till fler strÃ¤ngar eller Ã¤ndrat nÃ¥gra strÃ¤ngar i ditt program kÃ¶r du `xgettext`_ igen, vilket genererar om mallfilen:

source: Then you can update individual translation files to match newly created templates (this includes reordering the strings to match new template):
sv: Sedan kan du uppdatera enskilda Ã¶versÃ¤ttningsfiler sÃ¥ att de matchar de nyskapade mallarna (detta inkluderar att ordna om strÃ¤ngarna sÃ¥ att de matchar den nya mallen):

source: When using Weblate, you typically don't need to run msgmerge manually. Weblate can handle this automatically through the :ref:`addon-weblate.gettext.msgmerge` add-on, or you can upload the updated POT file using the :guilabel:`Update source strings` upload method. See :ref:`updating-target-files` for details.
sv: NÃ¤r du anvÃ¤nder Weblate behÃ¶ver du vanligtvis inte kÃ¶ra msgmerge manuellt. Weblate kan hantera detta automatiskt genom tillÃ¤gget :ref:`addon-weblate.gettext.msgmerge`, eller sÃ¥ kan du ladda upp den uppdaterade POT-filen med hjÃ¤lp av uppladdningsmetoden :guilabel:`Uppdatera kÃ¤llstrÃ¤ngar`. Se :ref:`updating-target-files` fÃ¶r mer information.

source: Importing to Weblate
sv: Importera till Weblate

source: To import such translation into Weblate, all you need to define are the following fields when creating component (see :ref:`component` for detailed description of the fields):
sv: FÃ¶r att importera en sÃ¥dan Ã¶versÃ¤ttning till Weblate behÃ¶ver du bara definiera fÃ¶ljande fÃ¤lt nÃ¤r du skapar komponenten (se :ref:`component` fÃ¶r en detaljerad beskrivning av fÃ¤lten):

source: Field
sv: FÃ¤lt

source: URL of the VCS repository with your project
sv: URL till VCS-arkivet med ditt projekt

source: Choose :guilabel:`gettext PO file`
sv: VÃ¤lj :guilabel:`gettext PO-fil`

source: New language
sv: Nytt sprÃ¥k

source: Choose :guilabel:`Create new language file`
sv: VÃ¤lj :guilabel:`Skapa ny sprÃ¥kfil`

source: And that's it, you're now ready to start translating your software!
sv: Och det var allt, nu Ã¤r du redo att bÃ¶rja Ã¶versÃ¤tta din programvara!

source: You can find a gettext example with many languages in the Weblate Hello project on GitHub: <https://github.com/WeblateOrg/hello>.
sv: Du kan hitta ett gettext-exempel med mÃ¥nga sprÃ¥k i Weblate Hello-projektet pÃ¥ GitHub: <https://github.com/WeblateOrg/hello>.

source: Translating HTML and JavaScript using Weblate CDN
sv: ÃversÃ¤ttning av HTML och JavaScript med Weblate CDN

source: Starting with Weblate 4.2 it is possible to export localization to a CDN using :ref:`addon-weblate.cdn.cdnjs` add-on.
sv: FrÃ¥n och med Weblate 4.2 Ã¤r det mÃ¶jligt att exportera lokalisering till ett CDN med hjÃ¤lp av tillÃ¤gget :ref:`addon-weblate.cdn.cdnjs`.

source: This feature is configured on Hosted Weblate. It requires additional configuration on your installation, see :setting:`LOCALIZE_CDN_URL` and :setting:`LOCALIZE_CDN_PATH`.
sv: Denna funktion konfigureras pÃ¥ Hosted Weblate. Den krÃ¤ver ytterligare konfiguration pÃ¥ din installation, se :setting:`LOCALIZE_CDN_URL` och :setting:`LOCALIZE_CDN_PATH`.

source: Upon installation into your component it will push committed translations (see :ref:`lazy-commit`) to the CDN and these can be used in your web pages to localize them.
sv: NÃ¤r det har installerats i din komponent kommer det att skicka bekrÃ¤ftade Ã¶versÃ¤ttningar (se :ref:`lazy-commit`) till CDN, och dessa kan anvÃ¤ndas pÃ¥ dina webbsidor fÃ¶r att lokalisera dem.

source: Creating component
sv: Skapar komponent

source: First, you need to create a monolingual component which will hold your strings, see :ref:`adding-projects` for generic instructions on that.
sv: FÃ¶rst mÃ¥ste du skapa en ensprÃ¥kig komponent som kommer att innehÃ¥lla dina strÃ¤ngar. Se :ref:`adding-projects` fÃ¶r allmÃ¤nna instruktioner om detta.

source: In case you have existing repository to start with (for example the one containing HTML files), create an empty JSON file in the repository for the source language (see :ref:`component-source_language`), for example :file:`locales/en.json`. The content should be ``{}`` to indicate an empty object. Once you have that, the repository can be imported into Weblate and you can start with an add-on configuration.
sv: Om du redan har ett befintligt arkiv att utgÃ¥ ifrÃ¥n (till exempel det som innehÃ¥ller HTML-filer), skapa en tom JSON-fil i arkivet fÃ¶r kÃ¤llsprÃ¥ket (se :ref:`component-source_language`), till exempel :file:`locales/en.json`. InnehÃ¥llet ska vara ``{}`` fÃ¶r att ange ett tomt objekt. NÃ¤r du har gjort det kan arkivet importeras till Weblate och du kan bÃ¶rja med en tillÃ¤ggskonfiguration.

source: In case you have existing translations, you can place them into the language JSON files and those will be used in Weblate.
sv: Om du har befintliga Ã¶versÃ¤ttningar kan du placera dem i sprÃ¥k-JSON-filerna sÃ¥ kommer de att anvÃ¤ndas i Weblate.

source: For those who do not want to use existing repository (or do not have one), choose :guilabel:`Start from scratch` when creating component and choose `JSON file` as a file format (it is okay to choose any monolingual format at this point).
sv: FÃ¶r dem som inte vill anvÃ¤nda ett befintligt arkiv (eller inte har nÃ¥got) vÃ¤ljer man :guilabel:`Start from scratch` nÃ¤r man skapar komponenten och vÃ¤ljer `JSON file` som filformat (det gÃ¥r bra att vÃ¤lja vilket ensprÃ¥kigt format som helst i detta skede).

source: Configuring Weblate CDN add-on
sv: Konfigurera Weblate CDN-tillÃ¤gg

source: The :ref:`addon-weblate.cdn.cdnjs` add-on provides few configuration options.
sv: TillÃ¤gget :ref:`addon-weblate.cdn.cdnjs` erbjuder nÃ¥gra fÃ¥ konfigurationsalternativ.

source: Translations translated above this threshold will be included in the CDN.
sv: ÃversÃ¤ttningar som Ã¶versÃ¤tts Ã¶ver denna trÃ¶skel kommer att inkluderas i CDN.

source: Configures which strings from the HTML documents are translatable, see :ref:`cdn-addon-extract` and :ref:`cdn-addon-html`.
sv: Konfigurerar vilka strÃ¤ngar frÃ¥n HTML-dokumenten som Ã¤r Ã¶versÃ¤ttningsbara, se :ref:`cdn-addon-extract` och :ref:`cdn-addon-html`.

source: Name of cookie which contains user selected language. Used in the JavaScript snippet for :ref:`cdn-addon-html`.
sv: Namn pÃ¥ cookie som innehÃ¥ller det sprÃ¥k som anvÃ¤ndaren valt. AnvÃ¤nds i JavaScript-snippet fÃ¶r :ref:`cdn-addon-html`.

source: List of files in the repository or URLs where Weblate will look for translatable strings and offer them for a translation, see :ref:`cdn-addon-extract`.
sv: Lista Ã¶ver filer i arkivet eller URL:er dÃ¤r Weblate kommer att sÃ¶ka efter Ã¶versÃ¤ttningsbara strÃ¤ngar och erbjuda dem fÃ¶r Ã¶versÃ¤ttning, se :ref:`cdn-addon-extract`.

source: String extraction for Weblate CDN
sv: StrÃ¤ngutdragning fÃ¶r Weblate CDN

source: The translation strings have to be present in Weblate. You can either manage these manually, use API to create them or list files or URLs using :guilabel:`Extract strings from HTML files` and Weblate will extract them automatically. The files have to present in the repository or contain remote URLs which will be download and parsed regularly by Weblate.
sv: ÃversÃ¤ttningsstrÃ¤ngarna mÃ¥ste finnas i Weblate. Du kan antingen hantera dessa manuellt, anvÃ¤nda API fÃ¶r att skapa dem eller lista filer eller URL:er med hjÃ¤lp av :guilabel:`Extrahera strÃ¤ngar frÃ¥n HTML-filer`, sÃ¥ extraherar Weblate dem automatiskt. Filerna mÃ¥ste finnas i arkivet eller innehÃ¥lla fjÃ¤rr-URL:er som kommer att laddas ner och analyseras regelbundet av Weblate.

source: The default configuration for :guilabel:`CSS selector` extracts elements with CSS class ``l10n``, for example it would extract two strings from following snippets:
sv: Standardkonfigurationen fÃ¶r :guilabel:`CSS-selektor` extraherar element med CSS-klassen ``l10n``, till exempel skulle den extrahera tvÃ¥ strÃ¤ngar frÃ¥n fÃ¶ljande kodsnuttar:

source: In case you don't want to modify existing code, you can also use ``*`` as a selector to process all elements.
sv: Om du inte vill Ã¤ndra befintlig kod kan du ocksÃ¥ anvÃ¤nda ``*`` som selektor fÃ¶r att bearbeta alla element.

source: Right now, only text of the elements is extracted. This add-on doesn't support localization of element attributes or elements with children.
sv: Just nu extraheras endast elementens text. Detta tillÃ¤gg stÃ¶der inte lokalisering av elementattribut eller element med underordnade element.

source: HTML localization using Weblate CDN
sv: HTML-lokalisering med Weblate CDN

source: To localize a HTML document, you need to load the :file:`weblate.js` script:
sv: FÃ¶r att lokalisera ett HTML-dokument mÃ¥ste du ladda skriptet :file:`weblate.js`:

source: Upon loading, this will automatically find all matching translatable elements (based on :guilabel:`CSS selector` configuration) and replace their text with a translation.
sv: Vid inlÃ¤sning hittar detta automatiskt alla matchande Ã¶versÃ¤ttningsbara element (baserat pÃ¥ :guilabel:`CSS-selektorkonfiguration`) och ersÃ¤tter deras text med en Ã¶versÃ¤ttning.

source: The user language is detected from the configured cookie and falls back to user preferred languages configured in the browser.
sv: AnvÃ¤ndarens sprÃ¥k identifieras frÃ¥n den konfigurerade cookien och faller tillbaka till anvÃ¤ndarens Ã¶nskade sprÃ¥k som konfigurerats i webblÃ¤saren.

source: The :guilabel:`Language cookie name` can be useful for integration with other applications (for example choose ``django_language`` when using Django).
sv: :guilabel:`SprÃ¥kkookienamn` kan vara anvÃ¤ndbart fÃ¶r integration med andra applikationer (vÃ¤lj till exempel ``django_language`` nÃ¤r du anvÃ¤nder Django).

source: JavaScript localization
sv: Lokalisering fÃ¶r JavaScript

source: The individual translations are exposed as bilingual JSON files under the CDN. To fetch one you can use following code:
sv: De enskilda Ã¶versÃ¤ttningarna visas som tvÃ¥sprÃ¥kiga JSON-filer under CDN. FÃ¶r att hÃ¤mta en kan du anvÃ¤nda fÃ¶ljande kod:

source: The actual localization logic needs to be implemented in this case.
sv: I detta fall mÃ¥ste den faktiska lokaliseringslogiken implementeras.

source: Integrating with Weblate
sv: Integrering med Weblate

source: Weblate basics
sv: Grunderna i Weblate

source: Project and component structure
sv: Projekt- och komponentstruktur

source: In Weblate translations are organized into projects and components. Each project can contain number of components and those contain translations into individual languages. The component corresponds to one translatable file (for example :ref:`gettext` or :ref:`aresource`). The projects are there to help you organize component into logical sets (for example to group all translations used within one application).
sv: I Weblate Ã¤r Ã¶versÃ¤ttningar organiserade i projekt och komponenter. Varje projekt kan innehÃ¥lla ett antal komponenter och dessa innehÃ¥ller Ã¶versÃ¤ttningar till enskilda sprÃ¥k. Komponenten motsvarar en Ã¶versÃ¤ttningsbar fil (till exempel :ref:`gettext` eller :ref:`aresource`). Projekten finns till fÃ¶r att hjÃ¤lpa dig att organisera komponenter i logiska uppsÃ¤ttningar (till exempel fÃ¶r att gruppera alla Ã¶versÃ¤ttningar som anvÃ¤nds inom en applikation).

source: Additionally, components within projects can be structured using categories. Components can belong to a category, and categories can be nested.
sv: Dessutom kan komponenter inom projekt struktureras med hjÃ¤lp av kategorier. Komponenter kan tillhÃ¶ra en kategori, och kategorier kan vara hierarkiska.

source: Internally, each project has translations to common strings propagated across other components within it by default. This lightens the burden of repetitive and multi version translation. The translation propagation can be disabled per :ref:`component` using :ref:`component-allow_translation_propagation` in case the translations should diverge.
sv: Internt har varje projekt Ã¶versÃ¤ttningar till vanliga strÃ¤ngar som sprids till andra komponenter inom projektet som standard. Detta minskar bÃ¶rdan av repetitiva Ã¶versÃ¤ttningar och Ã¶versÃ¤ttningar i flera versioner. ÃversÃ¤ttningsspridningen kan inaktiveras per :ref:`component` med hjÃ¤lp av :ref:`component-allow_translation_propagation` om Ã¶versÃ¤ttningarna skulle skilja sig Ã¥t.

source: Repository integration
sv: Integrering av arkiv

source: Weblate is built to integrate with upstream version control repository, :doc:`/admin/continuous` describes building blocks and how the changes flow between them.
sv: Weblate Ã¤r byggt fÃ¶r att integreras med uppstrÃ¶ms versionskontrollfÃ¶rvar, :doc:`/admin/continuous` beskriver byggstenar och hur fÃ¶rÃ¤ndringarna flÃ¶dar mellan dem.

source: :ref:`architecture` describes how Weblate works internally.
sv: :ref:`architecture` beskriver hur Weblate fungerar internt.

source: User attribution
sv: AnvÃ¤ndarattribution

source: Weblate keeps the translations properly authored by translators in the version control repository by using name and e-mail. Having a real e-mail attached to the commit follows the distributed version control spirits and allows services like GitHub to associate your contributions done in Weblate with your GitHub profile.
sv: Weblate sparar Ã¶versÃ¤ttningarna som Ã¶versÃ¤ttarna har skapat i versionskontrollfÃ¶rvaret med hjÃ¤lp av namn och e-postadress. Att ha en riktig e-postadress kopplad till commit fÃ¶ljer principerna fÃ¶r distribuerad versionskontroll och gÃ¶r det mÃ¶jligt fÃ¶r tjÃ¤nster som GitHub att koppla dina bidrag i Weblate till din GitHub-profil.

source: This feature also brings in risk of misusing e-mail published in the version control commits. Moreover, once such a commit is published on public hosting (such as GitHub), there is effectively no way to redact it. Weblate allows choosing a private commit e-mail in :ref:`profile-account` to avoid this.
sv: Denna funktion medfÃ¶r ocksÃ¥ en risk fÃ¶r missbruk av e-postmeddelanden som publiceras i versionskontrollens commit. Dessutom finns det i praktiken inget sÃ¤tt att redigera en sÃ¥dan commit nÃ¤r den vÃ¤l har publicerats pÃ¥ en offentlig hosting (som GitHub). Weblate gÃ¶r det mÃ¶jligt att vÃ¤lja ett privat commit-e-postmeddelande i :ref:`profile-account` fÃ¶r att undvika detta.

source: Therefore, admins should consider this while configuring Weblate:
sv: DÃ¤rfÃ¶r bÃ¶r administratÃ¶rer ta hÃ¤nsyn till detta nÃ¤r de konfigurerar Weblate:

source: Such a usage of e-mail should be clearly described in service terms in case such document is needed. :ref:`legal` can help with that.
sv: En sÃ¥dan anvÃ¤ndning av e-post bÃ¶r tydligt beskrivas i tjÃ¤nstevillkoren om ett sÃ¥dant dokument behÃ¶vs. :ref:`legal` kan hjÃ¤lpa till med det.

source: :setting:`PRIVATE_COMMIT_EMAIL_OPT_IN` can make e-mails private by default.
sv: :setting:`PRIVATE_COMMIT_EMAIL_OPT_IN` kan gÃ¶ra e-postmeddelanden privata som standard.

source: Importing a localization project into Weblate
sv: Importera ett lokaliseringsprojekt till Weblate

source: Weblate has been developed with VCS integration in mind as itâs core feature, so the easiest way is to grant Weblate the access to your repository. The import process will guide you through configuring your translations into Weblate components.
sv: Weblate har utvecklats med VCS-integration som en central funktion, sÃ¥ det enklaste sÃ¤ttet Ã¤r att ge Weblate Ã¥tkomst till ditt arkiv. Importprocessen guidar dig genom konfigureringen av dina Ã¶versÃ¤ttningar till Weblate-komponenter.

source: Alternatively, you can let Weblate set up a local-only repository containing all the translations without integration.
sv: Alternativt kan du lÃ¥ta Weblate skapa ett lokalt arkiv som innehÃ¥ller alla Ã¶versÃ¤ttningar utan integration.

source: Fetching updated translations from Weblate
sv: HÃ¤mta uppdaterade Ã¶versÃ¤ttningar frÃ¥n Weblate

source: Weblate stores updated strings in a database and commits them to a local version-control repository. You can add a Weblate repository (when :ref:`git-exporter` is turned on) as an additional remote repository and fetch translation updates from it.
sv: Weblate lagrar uppdaterade strÃ¤ngar i en databas och Ã¶verfÃ¶r dem till ett lokalt versionskontrollarkiv. Du kan lÃ¤gga till ett Weblate-arkiv (nÃ¤r :ref:`git-exporter` Ã¤r aktiverat) som ett extra fjÃ¤rrarkiv och hÃ¤mta Ã¶versÃ¤ttningsuppdateringar frÃ¥n det.

source: Prior to this, you might want to commit any pending local changes made in Weblate (see :ref:`lazy-commit`). This can be done from the user interface (in the :guilabel:`Repository maintenance`), or from the command-line using :ref:`wlc`.
sv: Innan detta kan du behÃ¶va bekrÃ¤fta eventuella lokala Ã¤ndringar som gjorts i Weblate (se :ref:`lazy-commit`). Detta kan gÃ¶ras frÃ¥n anvÃ¤ndargrÃ¤nssnittet (i :guilabel:`Repository maintenance`), eller frÃ¥n kommandoraden med hjÃ¤lp av :ref:`wlc`.

source: Pushing changes can be automated if you grant Weblate push access to your repository and configure :ref:`component-push` in the :ref:`component`, see :ref:`push-changes`.
sv: Att skicka Ã¤ndringar kan automatiseras om du ger Weblate push-Ã¥tkomst till ditt arkiv och konfigurerar :ref:`component-push` i :ref:`component`, se :ref:`push-changes`.

source: Alternatively, use :doc:`/api` to update translations so that they match the latest version from the upstream in your remote VCS repository.
sv: Alternativt kan du anvÃ¤nda :doc:`/api` fÃ¶r att uppdatera Ã¶versÃ¤ttningarna sÃ¥ att de matchar den senaste versionen frÃ¥n uppstrÃ¶ms i ditt fjÃ¤rr-VCS-arkiv.

source: Fetching remote changes into Weblate
sv: HÃ¤mta fjÃ¤rrÃ¤ndringar till Weblate

source: To fetch any strings recently updated in your remote VCS repository into Weblate, allow Weblate to pull from the upstream repository. This can be achieved in the user interface (in the :guilabel:`Repository maintenance`), or from the command-line using :ref:`wlc`.
sv: FÃ¶r att hÃ¤mta alla strÃ¤ngar som nyligen uppdaterats i ditt fjÃ¤rr-VCS-arkiv till Weblate, lÃ¥t Weblate hÃ¤mta frÃ¥n uppstrÃ¶msarkivet. Detta kan gÃ¶ras i anvÃ¤ndargrÃ¤nssnittet (i :guilabel:`Repository maintenance`), eller frÃ¥n kommandoraden med hjÃ¤lp av :ref:`wlc`.
